# PANDAS V: Unión de datos

En este ejercicio pondremos en práctica los conceptos básicos para juntar varios csv que compartan información.

Trabajaremos con tres ficheros diferentes:

- El csv que creamos en el ejercicio de pair programming Pandas IV, dónde recordamos eliminamos ciertas columnas que no eran necesarias, y habíamos creado nuevas.
  
- El csv llamado attacks_historico donde tenemos información sobre los ataques de tiburón previos al año 1800, este fichero lo tenéis un poco mas abajo para descargar.
  
- El csv llamado attacks_adicional donde tenemos información sobre los ataques de tiburón. de nuevo, este fichero lo tenéis abajo para descargar.

##### El principal objetivo de este ejercicio de pair programming es acabar teniendo un único DataFrame con toda la información contenida en los tres csv anteriores.

Para llevar a cabo nuestro objetivo tendréis que seguir los siguientes pasos:

In [35]:
import pandas as pd
import numpy as np

### 1. Cargad los tres ficheros nombrados anteriormente.
Los exploramos para familizarizarnos con ellos y saber que información tienen en común y debatir con tu compañera como podríamos juntar toda la información.

In [26]:
df1 = pd.read_csv("datos/attacks_pandas4.csv")
df1.head(1)

,Unnamed: 0,case_number,unnamed:_0,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
0,0,2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [44]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1502 entries, 2018.06.25 to 1868.05.13
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   unnamed:_0  1502 non-null   int64
 1   year        1502 non-null   float64
 2   type        1502 non-null   object
 3   country     1502 non-null   object
 4   area        1502 non-null   object
 5   location    1502 non-null   object
 6   activity    1502 non-null   object
 7   name        1502 non-null   object
 8   sex_        1502 non-null   object
 9   age         1502 non-null   object
 10  time        1502 non-null   object
 11  species_    1502 non-null   object
 12  href        1502 non-null   object
 13  siglo       1502 non-null   object
dtypes: float64(1), int64(1), object(12)
memory usage: 176.0+ KB

In [27]:
df2 = pd.read_csv("datos/attacks_adicional.csv")
df2.head(1)

,Unnamed: 0,Case Number,Fatal (Y/N),Injury,Date
0,0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

In [45]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6288 entries, 0 to 6287
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   unnamed:_0   6288 non-null   int64
 1   case_number  6287 non-null   object
 2   fatal_(y/n)  5751 non-null   object
 3   injury       6258 non-null   object
 4   date         6286 non-null   object
dtypes: int64(1), object(4)
memory usage: 245.8+ KB

In [28]:
df3 = pd.read_csv("datos/attacks_historico.csv")
df3.head(1)

,Unnamed: 0,Case Number,Year,Type,Country,Area,Location,Activity,Name,Sex,...,Species,Investigator or Source,pdf,href formula,href,Case Number.1,Case Number.2,original order,Unnamed: 22,Unnamed: 23
0,6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,...,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0,NaN,NaN

In [46]:
df3.info()

<class 'pandas.core.frame.DataFrame'>
Index: 170 entries, 1800.00.00 to ND.0001
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   unnamed:_0  170 non-null    int64
 1   year        170 non-null    float64
 2   type        170 non-null    object
 3   country     160 non-null    object
 4   area        124 non-null    object
 5   location    119 non-null    object
 6   activity    139 non-null    object
 7   name        161 non-null    object
 8   sex_        156 non-null    object
 9   age         16 non-null     object
 10  time        10 non-null     object
 11  species_    44 non-null     object
 12  href        170 non-null    object
 13  siglo       170 non-null    object
dtypes: float64(1), int64(1), object(12)
memory usage: 19.9+ KB

### 2. Chequead que los nombres de las columnas ver si se llaman iguales entre dataframes. 
¿Están todas en minúsculas? ¿Tienen espacios? En caso de que no sean todas iguales unificad el nombre de las columnas.

In [29]:
columnas_nuevas3 = {col: col.lower().replace(" ", "_")  for col in df3.columns}
df3.rename(columns = columnas_nuevas3, inplace = True)
df3.head(1)

,unnamed:_0,case_number,year,type,country,area,location,activity,name,sex_,...,species_,investigator_or_source,pdf,href_formula,href,case_number.1,case_number.2,original_order,unnamed:_22,unnamed:_23
0,6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,...,NaN,V. C. Harvey-Brain,1800.00.00-Corsair-boat.pdf,http://sharkattackfile.net/spreadsheets/pdf_di...,http://sharkattackfile.net/spreadsheets/pdf_di...,1800.00.00,1800.00.00,171.0,NaN,NaN

In [30]:
columnas_nuevas2 = {col: col.lower().replace(" ", "_") for col in df2.columns}
df2.rename(columns = columnas_nuevas2, inplace = True)
df2.head(1)

,unnamed:_0,case_number,fatal_(y/n),injury,date
0,0,2018.06.25,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

### 3. En este momento nos habremos dado cuenta que el DataFrame que generamos en el pair programming Pandas IV es similar al DataFrame de los datos historicos. 
Si recordamos, eliminamos algunas columnas en la sesión III que no eran útiles, pero esas columnas están todavía en el histórico. 

Si no fuera por eso podríamos unir esos dataframes. 

Realizad los cambios que creais necesarios para que los dataframes sean iguales y luego juntadlos usando el mejor método.

In [36]:
df1.drop(["Unnamed: 0"], axis = 1, inplace = True)
df1.head(1)

,case_number,unnamed:_0,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
0,2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [31]:
df3.drop(["unnamed:_22", "unnamed:_23", "case_number.1", "case_number.2", "original_order", "investigator_or_source", "pdf", "href_formula"], axis = 1, inplace = True)
df3.head(1)

,unnamed:_0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href
0,6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...

In [37]:
df3["siglo"] = np.where(df3["year"] < 2000, "siglo-XX", "siglo-XXI")
df3.head()

,unnamed:_0,case_number,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
0,6132,1800.00.00,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XX
1,6133,1797.05.28.R,1797.0,Unprovoked,NaN,NaN,NaN,Dropped overboard,child,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XX
2,6134,1792.09.12,1792.0,Provoked,ENGLAND,NaN,On the Thames River,Fishing,male,M,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XX
3,6135,1791.00.00,1791.0,Unprovoked,AUSTRALIA,New South Wales,Port Jackson,NaN,"female, an Australian aboriginal",F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XX
4,6136,1788.05.10,1788.0,Boat,AUSTRALIA,New South Wales,Sydney Harbor,Fishing,boat,NaN,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XX

In [38]:
df1.columns

Index(['case_number', 'unnamed:_0', 'year', 'type', 'country', 'area',
       'location', 'activity', 'name', 'sex_', 'age', 'time', 'species_',
       'href', 'siglo'],
      dtype='object')

In [39]:
df3.columns

Index(['unnamed:_0', 'case_number', 'year', 'type', 'country', 'area',
       'location', 'activity', 'name', 'sex_', 'age', 'time', 'species_',
       'href', 'siglo'],
      dtype='object')

In [40]:
df1.set_index(["case_number"], inplace = True)
df1.head(1)

,unnamed:_0,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
case_number,,,,,,,,,,,,,,
2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [41]:
df3.set_index(["case_number"], inplace = True)
df3.head(1)

,unnamed:_0,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
case_number,,,,,,,,,,,,,,
1800.00.00,6132,1800.0,Unprovoked,SEYCHELLES,St. Anne,NaN,a corsair's boat was overturned,NaN,F,NaN,NaN,NaN,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XX

In [42]:
df_concat = pd.concat([df1, df3], axis=0)
df_concat.head()

,unnamed:_0,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo
case_number,,,,,,,,,,,,,,
2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
2018.06.03.a,6,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
2018.05.26.b,8,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
2018.05.24,10,2018.0,Provoked,AUSTRALIA,Queensland,Cairns Aquarium,Feeding sharks,male,M,32,Morning,Grey reef shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI
2018.05.13.a,13,2018.0,Invalid,ENGLAND,Cornwall,Off Land's End,Fishing,Max Berryman,M,21,08h15,Invalid incident,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI

In [43]:
df_concat.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1672 entries, 2018.06.25 to ND.0001
Data columns (total 14 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   unnamed:_0  1672 non-null   int64
 1   year        1672 non-null   float64
 2   type        1672 non-null   object
 3   country     1662 non-null   object
 4   area        1626 non-null   object
 5   location    1621 non-null   object
 6   activity    1641 non-null   object
 7   name        1663 non-null   object
 8   sex_        1658 non-null   object
 9   age         1518 non-null   object
 10  time        1512 non-null   object
 11  species_    1546 non-null   object
 12  href        1672 non-null   object
 13  siglo       1672 non-null   object
dtypes: float64(1), int64(1), object(12)
memory usage: 195.9+ KB

### 4. Es el momento de unir la información de todos los ataques de tiburón que acabamos de crear con el DataFrame de información adicional. 

Debatid que método es el más correcto para unir toda esta información y ejecutadlo.

📌 NOTA: Cuando hagáis la unión considerad que la información que más nos interesa es la del DataFrame que creamos en el apartado anterior, lo cual determinará el tipo de unión.

In [47]:
df2.set_index(["case_number"], inplace = True)
df2.head(1)

,unnamed:_0,fatal_(y/n),injury,date
case_number,,,,
2018.06.25,0,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018

In [55]:
df_join = df_concat.merge(df2, on="case_number", how="inner")
df_join.head()

,unnamed:_0_x,year,type,country,area,location,activity,name,sex_,age,time,species_,href,siglo,unnamed:_0_y,fatal_(y/n),injury,date
case_number,,,,,,,,,,,,,,,,,,
2018.06.25,0,2018.0,Boating,USA,California,"Oceanside, San Diego County",Paddling,Julie Wolfe,F,57,18h00,White shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,0,N,"No injury to occupant, outrigger canoe and pad...",25-Jun-2018
2018.06.03.a,6,2018.0,Unprovoked,BRAZIL,Pernambuco,"Piedade Beach, Recife",Swimming,Jose Ernesto da Silva,M,18,Late afternoon,Tiger shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,6,Y,FATAL,03-Jun-2018
2018.05.26.b,8,2018.0,Unprovoked,USA,Florida,"Cocoa Beach, Brevard County",Walking,Cody High,M,15,17h00,"Bull shark, 6'",http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,8,N,Lower left leg bitten,26-May-2018
2018.05.24,10,2018.0,Provoked,AUSTRALIA,Queensland,Cairns Aquarium,Feeding sharks,male,M,32,Morning,Grey reef shark,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,10,N,Minor bite to hand by captive shark. PROVOKED ...,24-May-2018
2018.05.13.a,13,2018.0,Invalid,ENGLAND,Cornwall,Off Land's End,Fishing,Max Berryman,M,21,08h15,Invalid incident,http://sharkattackfile.net/spreadsheets/pdf_di...,siglo-XXI,13,N,Injured by teeth of a dead porbeagle shark he ...,13-May-2018

In [56]:
df_join.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1672 entries, 2018.06.25 to ND.0001
Data columns (total 18 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   unnamed:_0_x  1672 non-null   int64
 1   year          1672 non-null   float64
 2   type          1672 non-null   object
 3   country       1662 non-null   object
 4   area          1626 non-null   object
 5   location      1621 non-null   object
 6   activity      1641 non-null   object
 7   name          1663 non-null   object
 8   sex_          1658 non-null   object
 9   age           1518 non-null   object
 10  time          1512 non-null   object
 11  species_      1546 non-null   object
 12  href          1672 non-null   object
 13  siglo         1672 non-null   object
 14  unnamed:_0_y  1672 non-null   int64
 15  fatal_(y/n)   1585 non-null   object
 16  injury        1664 non-null   object
 17  date          1672 non-null   object
dtypes: float64(1), int64(2), object(15)
memory usage: 248.2+ KB

### 5. Guardad el dataframe nuevo en un csv que usaremos mañana en la clase de pair programming

In [57]:
df_join.to_csv("datos/attacks_pandas5.csv")